// route_data.js
const routeStops = [
    { name: "लगनखेल", lat: 27.66747666, lng: 85.32208724 },
    { name: "कुमारीपाटी", lat: 27.67065110, lng: 85.32033109 },
    { name: "जावलाखेल ", lat: 27.67252351, lng:  85.3140789 },
    { name: "पुल्चोक", lat: 27.67614894, lng: 85.31574940 },
    { name: "कपण्डोल ", lat: 27.68785015, lng: 85.31630198 },
    { name: "त्रिपुरेश्वर", lat: 27.69409303, lng: 85.31407947 },
    { name: "एन.ए.सी", lat: 27.70119862, lng: 85.31346078 }, 
    { name: "जमल", lat: 27.70894471, lng: 85.31557948 },
    { name: "लैनचौर", lat: 27.71814637, lng: 85.31701942 },
    { name: "पानीपोखरी", lat: 27.72929860, lng: 85.32484312 },
    { name: "राष्ट्रपति भवन", lat: 27.73285233, lng: 85.32863022 },
    { name: "शिक्षण अस्पताल", lat: 27.73397779, lng: 85.32999513 },
    { name: "नारायणगोपाल चोक", lat: 27.73991197, lng: 85.33699177 },
    { name: "गंगालाल हस्पिटल", lat: 27.74569204, lng: 85.34231084 },
    { name: " न्यूरो हस्पिटल", lat: 27.74920897, lng: 85.34543314 },
    { name: "गोल्फटार", lat: 27.75487082, lng: 85.34815503 },
    { name: "चपली", lat: 27.76767677, lng: 85.35569426 },
    { name: "Gen Z चोक", lat: 27.77490089, lng: 85.36099614 },
    { name: "बुढानिलकण्ठ", lat: 27.77636961, lng: 85.36195928 }
];